In [31]:
import pandas as pd
import numpy as np
import seaborn as sns
import statistics as st
import scipy.stats as stats

In [32]:
df = pd.read_csv('dataset w7.csv')

In [33]:
df.head(15)

    Gender Test preparation  Total Marks
0     male             none           14
1   female             none           28
2   female             none           18
3   female             none           48
4   female             none           21
5   female        completed           40
6     male             none           30
7   female             none           12
8     male             none           18
9     male             none           24
10    male        completed           44
11    male             none           23
12    male        completed           43
13    male             none           28
14  female             none           41

In [34]:
print(df.shape)

(28, 3)

In [35]:
df.isnull().sum()

Gender              0
Test preparation    0
Total Marks         0
dtype: int64

# 1.Descriptive analysis of dataset

In [36]:
df.describe(include='all')

        Gender Test preparation  Total Marks
count       28               28    28.000000
unique       2                2          NaN
top     female             none          NaN
freq        16               21          NaN
mean       NaN              NaN    32.321429
std        NaN              NaN    12.454520
min        NaN              NaN    12.000000
25%        NaN              NaN    22.500000
50%        NaN              NaN    33.000000
75%        NaN              NaN    43.250000
max        NaN              NaN    50.000000

# 2.Marks scored by male and female students are not same

In [37]:
stats.ttest_ind(df['Total Marks'][df['Gender'] == 'male'],
                 df['Total Marks'][df['Gender'] == 'female'])

Ttest_indResult(statistic=-0.6940885268848668, pvalue=0.4937822317960763)

null hypothesis=Marks scored by male and female students are not same
n=28-2=26
t_score=2.056
Here, |t-score|=0.69<2.056
Therefore, we cannot reject the null hypothesis.

Also, p-value=0.49>0.05
Therefore, we cannot reject the null hypothesis.

Hence marks are not same.

# 3.Test preparation helped the student or not

In [38]:
import scipy.stats as stats
stats.ttest_ind(df['Total Marks'][df['Test preparation'] == 'none'],
                 df['Total Marks'][df['Test preparation'] == 'completed'])

Ttest_indResult(statistic=-3.6143637527769217, pvalue=0.0012671292457320106)

null hypothesis= 'Test preparation does not help the students'.

|t-score|=3.614>2.056
  we can reject the null hypothesis.

p-value=0.001<0.05
 we can reject the null hypothesis.

Hence Test preparation  helps the students.